package com.cofire.common.utils.constant;

/**
 * 
 * @ClassName: CodeEnum
 * @Description:返回码分为10位，前两位划分子系统（00代表系统模块公共返回参数，01代表用户管理，依次类推）， 中间两位划分页面（每一个页面一个返回码），
 *                                                               五六位划分功能（00-新增，01-修改，02-删除，03-查询），七到十位自定义返回码（自定义不重复即可)
 * @date 2019年5月13日
 *
 */
public enum CodeEnum {

    E_000000("000000", "请求成功"),
    E_000100("000100", "查询成功"),
    E_010103("010103", "查询失败"),
    E_010101("010101", "缺少必填参数"),
    E_000102("000102", "查询结果为空"),
    E_000200("000200", "新增成功"),
    E_000400("000400", "删除成功"),
    E_010406("010406", "删除失败"),
    E_400("400", "请求处理异常，请稍后再试"),
    E_500("500","请求方式有误,请检查 GET/POST"),
    E_501("501", "请求路径不存在"),
    E_502("502", "权限不足"),
    E_10008("10008", "角色删除失败,尚有用户属于此角色"),
    E_10009("10009", "账户已存在"),

    E_20011("20011", "登陆已过期,请重新登陆"),
    E_20012("20012", "登录失败，账号或密码错误"),

    E_90003("90003", "缺少必填参数"),
    E_010204("010204", "该数据已经存在，不可重复添加"),
    E_010205("010205", "新增失败"),
    E_000300("000300", "修改成功"),
    E_010304("010304", "修改失败"),

    /**
     * 1,2为05表示数据字典；3,4两位表示页面，00表示dictMaintain页面；5,6两位表示操作类型，00-新增，01-修改，02-删除，03-查询,04-参数
     * 7,8两位表示操作结果，00表示操作成功，01表示操作失败，9,10两位表示操作成功或失败的原因，00为失败，01为已存在
     */
    E_0500030000("0500030000", "数据字典查询成功"),
    E_0500030100("0500030100", "数据字典查询失败"),
    E_0500000000("0500000000", "数据字典新增成功"),
    E_0500000100("0500000100","数据字典新增失败"),
    E_0500000101("0500000101", "数据字典新增失败：数据字典已存在"),
    E_0500010000("0500010000", "数据字典编辑成功"),
    E_0500010100("0500010100","数据字典编辑失败"),
    E_0500010101("0500010101", "数据字典编辑失败:此条记录不存在，请刷新网页！"),
    E_0500020000("0500020000", "数据字典删除成功"),
    E_0500020100("0500020100","数据字典删除失败"),
    E_0500020101("0500020101", "数据字典删除失败：此条记录不存在，请刷新网页！"),
    E_0500040100("0500040100","操作失败：参数异常"),
    E_0500040101("0500040101", "操作失败：组号不合法"),
    E_0500040102("0500040102","操作失败：组名不合法"),
    E_0500040103("0500040103", "操作失败：字典值不合法"),
    E_0500040104("0500040104", "操作失败：字典名称不合法"),

    E_0000000000("0000000000", "系统异常"),
    E_0000000001("0000000001", "请求方式错误"),
    E_0000000002("0000000002", "请求路径不存在"),
    E_0000000003("0000000003","权限不足"),
    E_0000000004("0000000004", "登录已过期请重新登录"),
    E_0000000005("0000000005", "账号或者密码缺失"),
    E_0000000006("0000000006","账号或者密码错误"),
    E_0000000007("0000000007", "登录成功"),
    E_0000000008("0000000008", "登录失败"),
    E_0000000009("0000000009","登出成功"),
    E_0000000010("0000000010", "登出失败"),
    E_0000000011("0000000011", "图片上传成功"),
    E_0000000012("0000000012","图片上传失败"),
    E_0000000013("0000000013", "图片不存在"),
    E_0000000014("0000000014","图片格式不正确"),
    E_0000000015("0000000015", "数据字典加载成功"),
    E_0000000016("0000000016", "数据字典加载失败"),
    /**
     * 前两位： 01 - 用户管理 三四位：00 - 用户信息维护 五六位：00-新增，01-编辑，02-删除，03-查询，04-查看详情，05-密码重置，06-角色设置，07-同步,08-审核,09-校验
     * 七-十位：0000-查询成功，0001-查询失败，0002-新增成功，0003-新增失败，0004-新增失败，该用户已存在，0005-查看详情成功，0006-查看详情失败，
     * 0008-修改成功，0009-修改失败，0013-删除成功，0014-删除失败 0015-重置密码成功，0016-重置密码失败，0017-审核失败，账号或密码错误，0018-审核成功, 0019 - 审核人和操作人不能是同一人
     */
    E_0100030000("0100030000", "查询成功"),
    E_0100030001("0100030001", "查询失败"),
    E_0100000002("0100000002", "新增成功"),
    E_0100000003("0100000003","新增失败"),
    E_0100000004("0100000004", "新增失败，该用户已存在"),
    E_0100010008("0100010008", "编辑成功"),
    E_0100010009("0100010009", "编辑失败"),
    E_0100020013("0100020013", "删除成功"),
    E_0100020014("0100020014", "删除失败"),
    E_0100050015("0100050015", "密码重置成功"),
    E_0100050016("0100050016","密码重置失败"),
    E_0100080017("0100080017", "审核失败,账号或密码错误"),
    E_0100080018("0100080018", "审核成功"),
    E_0100080019("0100080019","审核人和操作人不能是同一人"),
    E_0100040005("0100040005", "查看详情成功"),
    E_0100040006("0100040006", "查看详情失败"),
    /**
     * 参数校验： 后四位:0022-用户代码或用户名称参数异常 , 0023-联系方式异常
     */
    E_0100090022("0100090022", "操作失败，用户代码或用户名称参数异常"),
    E_0100090023("0100090023", "操作失败，联系方式格式错误"),

    /**
     * 前两位： 01 - 用户管理 三四位：01 - 角色维护 五六位：00-新增，01-编辑，02-删除，03-查询，04-查看详情，05-密码重置，06-角色设置，07-同步,08-审核
     * 七-十位：0000-查询成功，0001-查询失败，0002-新增成功，0003-新增失败，0004-新增失败，该用户已存在，0005-查看详情成功，0006-查看详情失败，
     * 0008-修改成功，0009-修改失败，0013-删除成功，0014-删除失败 0015-重置密码成功，0016-重置密码失败，0017-审核失败，账号或密码错误，0018-审核成功, 0019 - 审核人和操作人不能是同一人
     * 0020 - 角色设置成功，0021- 角色设置失败
     */
    E_0101030001("0101030001", "角色查询失败"),
    E_0101030000("0101030000", "角色查询成功"),
    E_0101000004("0101030004", "角色新增失败，该角色已经存在"),
    E_0101000002("0101000002","角色新增成功"),
    E_0101000003("0101030003", "角色新增失败"),
    E_0101010008("0101130008", "角色修改成功"),
    E_0101010009("0101130009","角色修改失败"),
    E_0101020014("0101020014", "删除角色失败"),
    E_0101020013("0101020013", "删除角色成功"),
    E_0101010020("0101130020","角色权限查询失败"),
    E_0101010021("0101130021", "角色权限查询成功"),
    E_0101060020("0101060020", "角色设置成功"),
    E_0101060021("0101060021","角色设置失败"),
    E_0101060022("0101060022", "操作失败，角色代码或角色名称参数异常"),
    E_0101060023("0101060023","操作失败，角色描述参数异常"),
    E_0101070001("0101070001", "用户信息同步成功"),
    E_0101070002("0101070002", "用户信息同步成功"),

    /**
     * 系统参数返回码信息： 前两位： 06-系统管理 三四位：00-系统参数管理 五六位：00-新增，01-修改，02-删除，03-查询，05-重置
     * 七-十位：0000-查询成功，0001-查询失败，0002-新增成功，0003-新增失败，0004-新增失败，该系统参数已存在， 0008-修改成功，0009-修改失败，0013-删除成功，0014-删除失败
     */
    E_0600030000("0600030000", "查询成功"),
    E_0600030001("0600030001", "查询失败"),
    E_0600030002("0600030002", "无符合条件的记录"),
    E_0600000002("0600000002","新增成功"),
    E_0600000003("0600000003", "新增失败"),
    E_0600000004("0600000004", "新增失败，该系统参数已存在"),
    E_0600000005("0600000005", "操作失败,输入的段号不合法"),
    E_0600000006("0600000006","操作失败,输入的参数号不合法"),
    E_0600000007("0600000007", "操作失败,输入的参数名不合法"),
    E_0600000008("0600000008", "操作失败,输入的参数值不合法"),
    E_0600000009("0600000009","操作失败,输入的备注不合法"),
    E_0600000010("0600000010", "新增失败,传入的参数为空"),
    E_0600020013("0600020013", "删除成功"),
    E_0600020014("0600020014","删除失败"),
    E_0600020015("0600020015", "系统不存在所要删除的数据"),
    E_0600010008("0600010008", "修改成功"),
    E_0600010009("0600010009", "修改失败"),

    /**
     * 系统参数返回码信息： 前两位： 03-组织架构 部门 三四位：00- 组织架构管理页面 01-审核人维度 02-导入导出员工维度 03-导入导出部门维度 五六位：00-新增，01-修改，02-删除，03-查询，05-重置 ，
     * 07-导入 ， 08-导出 七-十位：0000-查询成功，0001-查询失败，0002-新增成功，0003-新增失败， 0008-修改成功，0009-修改失败，0013-删除成功，0014-删除失败 0010-参数异常
     */
    E_0300999999("0300999999", "操作异常"),
    E_0300030000("0300030000", "查询成功"),
    E_0300030001("0300030001", "查询失败"),
    E_0300000002("0300000002","新增成功"),
    E_0300000001("0300000001", "新增失败"),
    E_0300010008("0300010008", "修改成功"),
    E_0300010009("0300010009", "修改失败"),
    E_0300020013("0300020013","删除成功"),
    E_0300020014("0300020014", "删除失败"),
    E_0300000010("0300000010", "新增入参异常"),
    E_0300010010("0300010010", "修改入参异常"),
    E_0301030000("0301030000", "审核人查询成功"),
    E_0301030001("0301030001", "审核人查询失败"),
    E_0301000002("0301000002", "审核人新增成功"),
    E_0301000001("0301000001","审核人新增失败"),
    E_0301020013("0301020013", "审核人删除成功"),
    E_0301020014("0301020014", "审核人删除失败"),
    E_0302070100("0302070100","文件导入成功"),
    E_0302070101("0302070101", "文件导入失败"),
    E_0302070102("0302070102", "文件格式异常"),
    E_0302070103("0302070103","文件解析有异常数据，已跳过处理"),
    E_0302080100("0302080100", "文件导出成功"),
    E_0302080101("0302080101","文件导出失败"),
    E_0303070100("0303070100", "文件导入成功"),
    E_0303070101("0303070101", "文件导入失败"),
    E_0303070102("0303070102", "文件格式异常"),
    E_0303070103("0303070103", "文件解析有异常数据，已跳过处理"),
    E_0303080100("0303080100", "文件导出成功"),
    E_0303080101("0303080101", "文件导出失败"),

    /**
     * 重置用户密码返回码信息： 前两位：07-重置用户密码 三四位：01-成功 00-失败 五六位：00 七-十位：
     */
    E_0900000000("0900000000", "修改密码失败"),
    E_0900000001("0900000001", "当前密码输入有误，修改密码失败"),
    E_0900000002("0900000002", "用户所输入的密码加密失败"),
    E_0901000002("0901000002","修改密码成功"),
    E_0901000003("0901000003", "您的账号出现异常，请重新登录"),
    E_0901000004("0901000004", "系统出现异常，请重新登录"),
    E_0901000005("0901000005","输入的密码包含汉字，重新输入"),
    E_0901000006("0901000006", "输入的新密码与原密码相同，请重新输入"),
    E_0901000007("0901000007", "新密码与确认新密码不相同，重新输入"),
    /**
     * 系统参数返回码信息： 前两位： 04- 日志管理 三四位：00- 登入登出日志管理页面 01- 操作日志管理页面 五六位：00-新增，01-修改，02-删除，03-查询，05-重置
     * 七-十位：0000-查询成功，0001-查询失败，0002-新增成功，0003-新增失败， 0008-修改成功，0009-修改失败，0013-删除成功，0014-删除失败
     */
    E_0400030000("0400030000", "查询成功"),
    E_0400030001("0400030001", "查询失败"),
    E_0401030000("0401030000", "查询成功"),
    E_0401030001("0401030001", "查询失败"),

    /**
     * 

     * 访客信息管理返回码信息： 一二位：10-访客信息管理 三四位：00-访客信息管理 五六位：00-查询，01-发卡，02-拒绝发卡，03-卡遗失，04-离场，05-查看详情，06-打印访客信息，07-承包商培训，08-vip信息,09-校验 10-pad端信息

     * 七-十位：0000-成功，0001-失败
     */
    E_1000000000("1000000000", "查询访客信息失败"),
    E_1000000001("1000000001", "查询访客信息成功"),
    E_1000010000("1000010000", "访客发卡失败"),
    E_1000010001("1000010001",
            "访客发卡成功"),
    E_1000020000("1000020000", "访客拒绝发卡失败"),
    E_1000020001("1000020001", "访客拒绝发卡成功"),
    E_1000030000("1000030000", "办理卡遗失失败"),
    E_1000030001("1000030001", "办理卡遗失成功"),
    E_1000040000("1000040000", "离场失败，请重新操作！"),
    E_1000040001("1000040001", "离场成功，请出门！"),
    E_1000000002("1000000002","查询访客信息时查询数据字典中卡状态出错！"),
    E_1000000003("1000000003", "查询访客信息时查询数据字典中证件类型出错！"),
    E_1000010002("1000010002", "发卡失败，请核对填写信息是否正确！"),
    E_1000010003("1000010003", "员工发卡失败，请保证员工编号且姓名被填写！"),
    E_1000010004("1000010004","承包商发卡失败，请填写证件号！"),
    E_1000010005("1000010005", "承包商发卡失败，确认填写的信息正确！"),
    E_1000010006("1000010006","承包商发卡失败，请确认填写姓名"),
    E_1000010007("1000010007", "员工发卡失败，请保证员工编号被填写！"),
    E_1000010008("1000010008","员工发卡失败，请保证员工姓名被填写！"),
    E_1000010009("1000010009", "该短期承包商有效期已过，请重新培训!"),
    E_1000070000("1000070000","承包商培训失败！"),
    E_1000070001("1000070001", "承包商培训成功！"),
    E_1000070002("1000070002","承包商培训失败，系统内无该承包商记录！"),
    E_1000070003("1000070003", "该承包商未过期，不可培训！"),
//    E_1000070004("1000070004", "未带卡的长期承包商无需培训"),
    E_1000080001( "1000080001", "新增访客失败！"),
    E_1000080002("1000080002", "新增访客成功！"),
    E_1000010010("1000010010", "该访客有未还的卡，请先还卡或办理遗失！"),
    E_1000100001("1000100001", "访客审核失败"),
    E_1000100002("1000100002", "访客审核成功，进行发卡！"),
    E_1000100003("1000100003","访客还卡成功"),

    E_1000090010("1000090010", "操作失败,传入的参数为空"),
    E_1000090011("1000090011", "操作失败,访客姓名长度不合规范"),
    E_1000090012("1000090012", "操作失败,访客姓名中不能包含数字"),
    E_1000090013("1000090013", "操作失败,手机号码不合规范"),
    E_1000090014("1000090014", "操作失败,名字不可以空格开头"),

    /**
     * 访客信息管理之 承包商管理返回码信息： 一二位：10-访客信息管理 三四位：01-承包商信息管理
     * 五六位：00-新增，01-修改，02-删除，03-查询，04-培训，05-发卡,06-修改有效期，07-还卡,08-校验,09-更新证件照 七-十位：0000-成功，0001-失败
     */
    E_1001030000("1001030000", "查询承包商信息成功"),
    E_1001030001("1001030001", "查询承包商信息失败"),
    E_1001030002("1001030002", "数据库中无符合条件的记录"),
    E_1001000001("1001000001","新增失败，数据库中已存在此uId值得记录"),
    E_1001000002("1001000002", "新增数据过程失败"),
    E_1001000003("1001000003", "新增数据过程失败,数据库中已有一条相同记录"),
    E_1001000000("1001000000","新增承包商信息成功"),
    E_1001999999("1001999999", "操作失败，出现系统异常错误"),
    E_1001010001("1001010001", "修改承包商信息失败"),
    E_1001010000("1001010000","修改承包商信息成功"),
    E_1001010002("1001010002", "该数据库中无当前操作的承包商，请刷新页面再次操作"),
    E_1001010003("1001010003","该数据库中当前操作的承包商无承包商字段，请刷新页面再次操作"),
    E_1001020001("1001020001", "操作失败，系统中不存在该承包商"),
    E_1001020002("1001020002","删除失败"),
    E_1001020000("1001020000", "删除成功"),
    E_1001090001("1001090001", "更新证件照失败"),
    E_1001090000("1001090000","更新证件照成功"),
    E_1001050001("1001050001", "发卡失败"),
    E_1001050002("1001050002","发卡成功"),
    E_1001040002("1001040002", "操作失败，该承包商已培训且处在有效期内"),
    E_1001040000("1001040000","操作成功，该承包商为已培训状态"),
    E_1001040001("1001040001", "培训该承包商操作失败"),
    E_1001060001("1001060001","修改有效期失败"),
    E_1001060000("1001060000", "修改有效期成功"),
    E_1001060002("1001060002","因为获取承包商类型有误致使修改承包商有效期失败"),
    E_1001070000("1001070000","还卡成功"),
    E_1001070001("1001070001","还卡失败"),
    E_1001080001("1001080001", "请将信息全部填写完整！"),
    /**
     * 系统参数返回码信息： 前两位： 07- 停车场管理 三四位：00- 登入登出日志管理页面 01- 操作日志管理页面 五六位：00-新增，01-修改，02-删除，03-查询，05-重置
     * 七-十位：0000-查询成功，0001-查询失败，0002-新增成功，0003-新增失败， 0008-修改成功，0009-修改失败，0013-删除成功，0014-删除失败
     */
    E_0700030000("0700030000", "查询车辆信息成功"),
    E_0700030001("0700030001", "查询车辆信息失败"),
    E_0700010008("0700010008", "修改车辆信息成功"),
    E_0700010009("0700010009","修改车辆信息失败"),
    E_0700020013("0700020013", "删除车辆信息成功"),
    E_0700020014("0700020014", "删除车辆信息失败"),
    E_0700999999("0700999999", "操作异常"),
    E_0701000002("0701000002", "车辆信息新增成功"),
    E_0701000001("0701000001", "车辆信息新增失败"),
    E_0700000010("0700000010", "操作失败,传入的参数为空"),
    E_0700000011("0700000011","操作失败！车主姓名字段不为空，且长度不能大于32位"),
    E_0700000012("0700000012", "操作失败！联系方式字段不为空，且长度不能大于30位"),
    E_0700000013("0700000013","操作失败！车牌号字段不为空，且长度不能大于32位"),
    E_0700000014("0700000014", "操作失败！车牌号不符合校验规则"),
    E_0700000015("0700000015","操作失败！车辆描述字段不为空，且长度不能大于200位"),
    E_0700000016("0700000016", "操作失败！来访事由字段不为空，且长度不能大于200位"),
    E_0700000017("0700000017","操作失败！停车区域字段不为空，且长度不能大于200位"),
    E_0700000018("0700000018", "操作失败！审核原因长度不能大于200位"),
    E_0700000019("0700000019","操作失败！联系方式不合规范"),
    E_0700060020("0700060020", "停车场报表查询成功"),
    E_0700060021("0700060021","停车场报表查询失败"),
    E_0700060022("0700060022", "车主姓名不能包含数字"),
    /**
     * 一二位：07-停车场管理   三四位：01-上报  02-车辆进出管理  03-停车场车辆审核     五六位：01-查询    06-审核 七到十位：0015-审核通过，0016-审核拒绝，0017-审核失败
     */

    E_0703060015("0703060015", "审核通过"),
    E_0703060016("0703060016", "审核拒绝"),
    E_0703060017("0703060017", "审核失败"),
    E_0703060018("0703060018", "审核失败,不能审核自己的提交记录"),
    E_0701060000("0701060000", "车辆上报失败"),
    E_0701060001("0701060001", "车辆上报成功"),
    E_0702010000("0702010000", "查询车辆进出记录失败"),
    E_0702010001("0702010001", "查询车辆进出记录成功"),

    /**
     * 一二位：08-移动端出门单 三四位：00固定， 五六位：操作位 00-新增，01-修改，02-删除，03-查询 04-审核 05-参数，；七到八位：00-成功，01-失败 九到十位：失败原因
     */
    E_0800000000("0800000000", "出门单申请成功"),
    E_0800000100("0800000100", "出门单申请失败"),
    E_0800010000("0800010000", "出门单修改成功"),
    E_0800010100("0800010100","出门单修改失败"),
    E_0800020000("0800020000", "出门单删除成功"),
    E_0800020100("0801020100", "出门单删除失败"),
    E_0800030000("0800030000","出门单查询成功"),
    E_0800030100("0800030100", "出门单查询失败"),
    E_0800040000("0800040000", "审核成功"),
    E_0800040100("0800040100","审核失败"),
    E_0800050100("0800050100", "操作失败：参数异常"),
    E_0800050101("0800050101", "操作失败：申请人姓名不合法"),
    E_0800050102("0800050102","操作失败：内部联系人姓名不合法"),
    E_0800050103("0800050103", "操作失败：申请人联系方式不合法"),
    E_0800050104("0800050104", "操作失败：内部人员联系方式不合法"),
    E_0800050105("0800050105", "操作失败：部门审核理由应为1-200个字符"),
    E_0800050106("0800050106","操作失败：EHS部门审核理由应为1-200个字符"),
    E_0800050107("0800050107", "操作失败：物品描述应为1-200个字符"),
    E_0800050108("0800050108","操作失败：证件号不合法"),
    E_0800050109("0800050109", "操作失败：车牌号不合法"),
    E_0800050110("0800050110","操作失败：部门审核人不能为空！"),
    E_0800050111("0800050111", "操作失败：EHS审核人不能为空！"),
    /**
     * 消防点名和人员管理:一二位：12 三四位：00:人员管理 01：消防点名 五六位：00-查询 七到十：0000-查询完成 0001-查询失败
     **/
    E_1200000000("E_1200000000", "查询完成"),
    E_1200000001("E_1200000001", "查询失败"),
    E_1201000000("E_1201000000", "查询完成"),
    E_1201000001("E_1201000001", "查询失败"),

    /**
     * 一二位: 11-docking 三四位：00 - 危险品维护 , 01 - 检查项 ，02-货车出入     五六位：00-查询，01-新增，02-编辑，03-删除 七到十位：
     * 0000-查询成功，0001-查询失败，0002-新增成功，0003-新增失败，0004-编辑成功，0005-编辑失败， 0006-删除成功，0007-删除失败
     */

    E_1100000000("1100000000", "查询成功"),
    E_1100000001("1100000001", "查询失败"),
    E_1100010002("1100010002", "新增成功"),
    E_1100010003("1100010003","新增失败"),
    E_1100020004("1100020004", "编辑成功"),
    E_1100020005("1100020005", "编辑失败"),
    E_1100030006("1100030006", "删除成功"),
    E_1100030007("1100030007","删除失败"),
    E_1101000000("1101000000", "查询成功"),
    E_1101000001("1101000001", "查询失败"),
    E_1101010002("1101010002","新增成功"),
    E_1101010003("1101010003", "新增失败"),
    E_1101020004("1101020004", "编辑成功"),
    E_1101020005("1101020005","编辑失败"),
    E_1101030006("1101030006", "删除成功"),
    E_1101030007("1101030007","删除失败"),
    E_1102000000("1102000000", "查询货车出入记录失败，预约单号不存在！"),
    E_1102000001("1102000001", "查询货车出入记录成功！"),
    E_1102020000("1102020000", "更新预约状态失败"),
    E_1102020001("1102020001", "更新预约状态成功"),
    E_1102020003("1102020003", "仓库已拒绝放行"),
    E_1102020004("1102020004", "门卫已拒绝放行成功"),
    E_1102020005("1102020005", "仓库已拒绝作业"),

    /**
     * E_13 系统管理-富文本管理  三四位00  五六位 00-查询，01-新增，02-编辑，03-删除
     * 七到十位  0000-查询成功，0001-查询失败，0002-新增成功，0003-新增失败，0010-参数异常 ，0011-组号和文本号重复
     * 0004-编辑成功，0005-编辑失败， 0006-删除成功，0007-删除失败
     */
    E_1300999999("1300999999", "操作异常"),
    E_1300000000("1300000000", "查询成功"),
    E_1300000001("1300000001", "查询失败"),
    E_1300010002("1300010002", "新增成功"),
    E_1300010003("1300010003", "新增失败"),
    E_1300010010("1300010010", "新增参数异常"),
    E_1300010011("1300010011", "组号和文本号重复"),
    E_1300020010("1300020010", "编辑参数异常"),
    E_1300020004("1300020004", "编辑成功"),
    E_1300020005("1300020005", "编辑失败"),
    E_1300030006("1300030006", "删除成功"),
    E_1300030007("1200030007", "删除失败"),

    ;


    private String code;

    private String message;

    CodeEnum(String code, String message) {
        this.code = code;
        this.message = message;
    }

    public String getCode() {
        return code;
    }

    public String getMessage() {
        return message;
    }

}